#include <iostream>
using namespace std;

int main() {
    char name[30];
    int ginum;
    cout << "                                                                            " << endl;
    cout << "  ####             ####                                                     " << endl;
    cout << "  ##  ##          ## ##                                                     " << endl;
    cout << "  ##   ##       ##   ##                                                  " << endl;
    cout << "  ##    ##     ##    ##                                                        " << endl; 
    cout << "  ##      ##  ##     ##       #############      ##                  ##     " << endl;
    cout << "  ##       ##        ##      ##           ##     ##      ####        ##     " << endl;
    cout << "  ##                 ##     ##            ##     ##      ##  ##      ##    " << endl;
    cout << "  ##                 ##    #################      ##     ##  ##      ##     " << endl;
    cout << "  ##                 ##    ##                      ##    ##  ##     ##      " << endl;
    cout << "  ##                 ##     ##                      ##   ##   ##    ##      " << endl;
    cout << "  ##                 ##      ##            ##        ##  ##   ##   ##       " << endl;
    cout << "  ##                 ##       ##############          #####    ####         " << endl;
    cout << "                                                                            " << endl;
    cout << "                                                                            " << endl;
    cout << "            ####             ####                                                          ***        " << endl;
    cout << "            ##  ##          ## ##                                                        *******      " << endl;
    cout << "            ##   ##       ##   ##                                                       **********       " << endl;
    cout << "            ##    ##     ##    ##                                                        ********         " << endl;
    cout << "            ##      ##  ##     ##       #############      ##                 ##         ******         " << endl;
    cout << "            ##       ##        ##      ##           ##     ##      ####       ##          *****           " << endl;
    cout << "            ##                 ##     ##            ##     ##      ##  ##      ##           ***         " << endl;
    cout << "            ##                 ##    #################      ##     ##  ##      ##            *          " << endl;
    cout << "            ##                 ##    ##                      ##    ##  ##     ##                        " << endl;
    cout << "            ##                 ##     ##                      ##   ##   ##    ##             *          " << endl;
    cout << "            ##                 ##      ##            ##        ##  ##   ##   ##             ***         " << endl;
    cout << "            ##                 ##       ##############          #####    ####                *             " << endl;
    cout << "                                                                                                            " << endl;
    cout << "                                                                                                         " << endl;







    cout << "================================================================================================================" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                     안녕하세요 뮤뮤에요! 사용자님의 성함을 입력해주세요  (별명도 가능!)                ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====               >> 이름 입력 :";  cin >> name;
    //cout << "====      반가워요 " << name << "님!! 뮤뮤가 " << name << " 님 기분에 꼭 맞는 노래 추천 해드릴게요!!        ====" << endl;                                                                              ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                            " << name << "님! 오늘의 기분은 어떠세요?                                   ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "==  1. 너무 행복해요!! '행복'  2. 슬퍼요ㅠㅠ 위로가 필요해요 '슬픔'  3. 다 부셔버리고 싶다!! 화가나요 '분노'  ==" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                * 그 외에 뮤뮤의 추천 곡을 더 듣고 싶으시면 아무 키나 눌러주세요! *                     ====" << endl;
    //cout << "====                      "<< name << "님의 기분을 알려주세요! >>                                             ====" << endl;                                                                   ====" << endl;
    cout << "====               >> 기분을 알려주세요!";  cin >> ginum;
        return 0;
}
