#include <iostream>

using namespace std;

/**int sad(int ginum) {
    int num = rand() % 10;
    string str[20];
    str[0] = "성공하는 사람은 행동을 하고, 행운과 불운을 모두 끌어안으며 결국에는 무언가를 이루어내곤 한다.";
    


    return str[num];
}*/

/*void angry(int ginum) {


}*/
int main() {
    char name[30];
    int ginum;
    cout << "                                                                            " << endl;
    cout << "  ####             ####                                                     " << endl;
    cout << "  ##  ##          ## ##                                                     " << endl;
    cout << "  ##   ##       ##   ##                                                  " << endl;
    cout << "  ##    ##     ##    ##                                                        " << endl; 
    cout << "  ##      ##  ##     ##       #############      ##                  ##     " << endl;
    cout << "  ##       ##        ##      ##           ##     ##      ####        ##     " << endl;
    cout << "  ##                 ##     ##            ##     ##      ##  ##      ##    " << endl;
    cout << "  ##                 ##    #################      ##     ##  ##      ##     " << endl;
    cout << "  ##                 ##    ##                      ##    ##  ##     ##      " << endl;
    cout << "  ##                 ##     ##                      ##   ##   ##    ##      " << endl;
    cout << "  ##                 ##      ##            ##        ##  ##   ##   ##       " << endl;
    cout << "  ##                 ##       ##############          #####    ####         " << endl;
    cout << "                                                                            " << endl;
    cout << "                                                                            " << endl;
    cout << "            ####             ####                                                          ***        " << endl;
    cout << "            ##  ##          ## ##                                                        *******      " << endl;
    cout << "            ##   ##       ##   ##                                                       **********       " << endl;
    cout << "            ##    ##     ##    ##                                                        ********         " << endl;
    cout << "            ##      ##  ##     ##       #############      ##                 ##          ******         " << endl;
    cout << "            ##       ##        ##      ##           ##     ##      ####       ##           ****           " << endl;
    cout << "            ##                 ##     ##            ##     ##      ##  ##      ##           **         " << endl;
    cout << "            ##                 ##    #################      ##     ##  ##      ##            *          " << endl;
    cout << "            ##                 ##    ##                      ##    ##  ##     ##                        " << endl;
    cout << "            ##                 ##     ##                      ##   ##   ##    ##             *          " << endl;
    cout << "            ##                 ##      ##            ##        ##  ##   ##   ##             ***         " << endl;
    cout << "            ##                 ##       ##############          #####    ####                *             " << endl;
    cout << "                                                                                                            " << endl;
    cout << "                                                                                                         " << endl;







    cout << "================================================================================================================" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                     안녕하세요 뮤뮤에요! 사용자님의 성함을 입력해주세요  (별명도 가능!)                ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "                                  >> 이름 입력 :";  cin >> name;
    cout << "                  반가워요 " << name << "님!! 뮤뮤가 " << name << " 님 기분에 꼭 맞는 노래 추천 해드릴게요!!        " << endl;                                                                            
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                            " << name << "님! 오늘의 기분은 어떠신가요?                                            ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "==  1. 너무 행복해요!! '행복'  2. 슬퍼요ㅠㅠ 위로가 필요해요 '슬픔'  3. 다 부셔버리고 싶다!! 화가나요 '분노'  ==" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                                                                                                        ====" << endl;
    cout << "====                * 그 외에 뮤뮤의 추천 곡을 더 듣고 싶으시면 아무 키나 눌러주세요! *                     ====" << endl;
    cout << "====                      " << name << "님의 기분을 알려주세요! >> "; cin >> ginum;

    switch (ginum) {
    case 1: cout << "================================================================================================================" << endl;
            cout << "\n";
            cout << "                    "<< name << "  님! 뮤뮤가 더 기분을 더 좋게 만들어드릴게요!! > <  뮤뮤의 추천 플레이 리스트는 " << endl; break;
    case 2: cout << "================================================================================================================" << endl;
            cout << "\n";
            cout << "                    " << name << "  님을 위한 뮤뮤의 플레이 리스트는 " << endl;  break;
            //cout << "                    " << sad(ginum);  break;
    case 3: cout << "================================================================================================================" << endl;
            cout << "\n"; 
            cout << "                    " << name << "  님을 위한 뮤뮤의 플레이 리스트는 " << endl; break;
    default: cout << "================================================================================================================" << endl;
             cout << "\n";
             cout << name << "님! 뮤뮤의 취향 추천곡을 들려드릴게요!! > < " << endl;
    }

        return 0;

}
